compare/k6-result.txt
PS D:\code\go\wx\wx\compare\k6> k6 run gin-upload.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

ERRO[0000] TypeError: Value is not an object: null
        at file:///D:/code/go/wx/wx/compare/k6/gin-upload.js:11:19(29)  hint="script exception"
PS D:\code\go\wx\wx\compare\k6> k6 run gin-upload.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

ERRO[0000] TypeError: Value is not an object: null
        at file:///D:/code/go/wx/wx/compare/k6/gin-upload.js:11:19(29)  hint="script exception"
PS D:\code\go\wx\wx\compare\k6> k6 run gin-upload.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: gin-upload.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 35s max duration (incl. graceful stop):
              * default: 100 looping VUs for 5s (gracefulStop: 30s)



  █ TOTAL RESULTS

    checks_total.......................: 1000    196.277434/s
    checks_succeeded...................: 100.00% 1000 out of 1000
    checks_failed......................: 0.00%   0 out of 1000

    ✓ single status 200
    ✓ single filename ok

    HTTP
    http_req_duration.......................................................: avg=10.3ms min=0s med=5.66ms max=64.19ms p(90)=29.04ms p(95)=31.26ms
      { expected_response:true }............................................: avg=10.3ms min=0s med=5.66ms max=64.19ms p(90)=29.04ms p(95)=31.26ms
    http_req_failed.........................................................: 0.00%  0 out of 500
    http_reqs...............................................................: 500    98.138717/s

    EXECUTION
    iteration_duration......................................................: avg=1.01s  min=1s med=1s     max=1.06s   p(90)=1.02s   p(95)=1.03s
    iterations..............................................................: 500    98.138717/s
    vus.....................................................................: 100    min=100      max=100   
    vus_max.................................................................: 100    min=100      max=100   

    NETWORK
    data_received...........................................................: 79 kB  16 kB/s
    data_sent...............................................................: 512 kB 101 kB/s



                                                                                                            
running (05.1s), 000/100 VUs, 500 complete and 0 interrupted iterations                                     
default ✓ [======================================] 100 VUs  5s  

PS D:\code\go\wx\wx\compare\k6> k6 run wx-upload.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: wx-upload.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 35s max duration (incl. graceful stop):
              * default: 100 looping VUs for 5s (gracefulStop: 30s)



  █ TOTAL RESULTS

    checks_total.......................: 500     98.817717/s
    checks_succeeded...................: 100.00% 500 out of 500
    checks_failed......................: 0.00%   0 out of 500

    ✓ single status 200

    HTTP
    http_req_duration.......................................................: avg=3.58ms min=0s med=2.23ms max=17.28ms p(90)=9.03ms p(95)=11.46ms
      { expected_response:true }............................................: avg=3.58ms min=0s med=2.23ms max=17.28ms p(90)=9.03ms p(95)=11.46ms
    http_req_failed.........................................................: 0.00%  0 out of 500
    http_reqs...............................................................: 500    98.817717/s

    EXECUTION
    iteration_duration......................................................: avg=1s     min=1s med=1s     max=1.02s   p(90)=1.02s  p(95)=1.02s
    iterations..............................................................: 500    98.817717/s
    vus.....................................................................: 100    min=100      max=100   
    vus_max.................................................................: 100    min=100      max=100   

    NETWORK
    data_received...........................................................: 62 kB  12 kB/s
    data_sent...............................................................: 520 kB 103 kB/s



                                                                                                            
running (05.1s), 000/100 VUs, 500 complete and 0 interrupted iterations                                     
default ✓ [======================================] 100 VUs  5s